jmartinez-silabs/connectedhomeip/examples/platform/efr32/wfx-host/sl_wfx_host_events.cpp
        if (flags & SL_WFX_CONNECT)
        {
            lwip_set_sta_link_up();

#ifdef SLEEP_ENABLED
            if (!(wfx_get_wifi_state() & SL_WFX_AP_INTERFACE_UP))
            {
                // Enable the power save
                sl_wfx_set_power_mode(WFM_PM_MODE_PS, 1);
                sl_wfx_enable_device_power_save();
            }
#endif
        }
        if (flags & SL_WFX_DISCONNECT)
        {
            lwip_set_sta_link_down();
        }

#ifdef SL_WFX_CONFIG_SCAN
        if (flags & SL_WFX_SCAN_COMPLETE)
        {
            // we don't process this here (see scan cgi handler)
        }
#endif
    }
}

static sl_status_t wfx_init(void)
{
    /* Initialize the WF200 used by the two interfaces */
    wfx_events_task_start();
    sl_status_t status = sl_wfx_init(&wifiContext);
    EFR32_LOG("FMAC Driver version    %s\r\n", FMAC_DRIVER_VERSION_STRING);
    switch (status)
    {
    case SL_STATUS_OK:
        wifiContext.state = SL_WFX_STARTED;
        EFR32_LOG("WF200 Firmware version %d.%d.%d\r\n", wifiContext.firmware_major, wifiContext.firmware_minor,
                  wifiContext.firmware_build);
        EFR32_LOG("WF200 initialization successful\r\n");

        if (wifiContext.state == SL_WFX_STA_INTERFACE_CONNECTED)
        {
            sl_wfx_send_disconnect_command();
        }

        break;
    case SL_STATUS_WIFI_INVALID_KEY:
        EFR32_LOG("Failed to init WF200: Firmware keyset invalid\r\n");
        break;
    case SL_STATUS_WIFI_FIRMWARE_DOWNLOAD_TIMEOUT:
        EFR32_LOG("Failed to init WF200: Firmware download timeout\r\n");
        break;
    case SL_STATUS_TIMEOUT:
        EFR32_LOG("Failed to init WF200: Poll for value timeout\r\n");
        break;
    case SL_STATUS_FAIL:
        EFR32_LOG("Failed to init WF200: Error\r\n");
        break;
    default:
        EFR32_LOG("Failed to init WF200: Unknown error\r\n");
    }

    return status;
}

/*****************************************************************************
 * @brief
 *    Initializes LwIP network interface
 *
 * @param[in]
 *    none
 *
 * @return
 *    struct netif * staNetif : pointer to the Station Network interface
 *    struct netif * apNetif:  pointer to the Access Point Network interface
 ******************************************************************************/
static void Netif_Config(struct netif * staNetif, struct netif * apNetif)
{
    if (staNetif != NULL)
    {
        ip_addr_t sta_ipaddr;
        ip_addr_t sta_netmask;
        ip_addr_t sta_gw;
        /* Initialize the Station information */
        ip_addr_set_zero_ip4(&sta_ipaddr);
        ip_addr_set_zero_ip4(&sta_netmask);
        ip_addr_set_zero_ip4(&sta_gw);

        /* Add station interfaces */
        netif_add(staNetif, (const ip4_addr_t *) &sta_ipaddr, (const ip4_addr_t *) &sta_netmask, (const ip4_addr_t *) &sta_gw, NULL,
                  &sta_ethernetif_init, &tcpip_input);

        /* Registers the default network interface */
        netif_set_default(staNetif);
    }

#ifdef SL_WFX_CONFIG_SOFTAP
    if (apNetif != NULL)
    {
        // ip_addr_t ap_ipaddr;
        // ip_addr_t ap_netmask;
        // ip_addr_t ap_gw;
        // /* Initialize the SoftAP information */
        // IP_ADDR4(&ap_ipaddr, ap_ip_addr0, ap_ip_addr1, ap_ip_addr2, ap_ip_addr3);
        // IP_ADDR4(&ap_netmask, ap_netmask_addr0, ap_netmask_addr1, ap_netmask_addr2, ap_netmask_addr3);
        // IP_ADDR4(&ap_gw, ap_gw_addr0, ap_gw_addr1, ap_gw_addr2, ap_gw_addr3);
        // netif_add(apNetif, &ap_ipaddr, &ap_netmask, &ap_gw, NULL, &ap_ethernetif_init, &ethernet_input);
    }
#endif /* SL_WFX_CONFIG_SOFTAP */
}

/****************************************************************************
 * Set station link status to up.
 *****************************************************************************/
sl_status_t lwip_set_sta_link_up(void)
{
    netifapi_netif_set_up(&sta_netif);
    netifapi_netif_set_link_up(&sta_netif);
    dhcpclient_set_link_state(1);

    return SL_STATUS_OK;
}

/***************************************************************************
 * Set station link status to down.
 *****************************************************************************/
sl_status_t lwip_set_sta_link_down(void)
{
    dhcpclient_set_link_state(0);
    netifapi_netif_set_link_down(&sta_netif);
    netifapi_netif_set_down(&sta_netif);
    return SL_STATUS_OK;
}

/*****************************************************************************
 * @brief
 *   tcp ip, wfx and lwip stack and start dhcp client.
 *
 * @param[in]
 *    not used
 *
 * @return
 *    sl_status_t Shows init succes or error.
 ******************************************************************************/
sl_status_t wfx_wifi_start(void)
{
    EFR32_LOG("STARTING WF200");
    sl_wfx_host_gpio_init();

    sl_status_t status = wfx_init();
    if (status == SL_STATUS_OK)
    {
        /* Initialize the LwIP stack */
        Netif_Config(&sta_netif, NULL);
        /* Start DHCP Client */
        dhcpclient_start();
    }

    return status;
}

sl_wfx_state_t wfx_get_wifi_state(void)
{
    return wifiContext.state;
}

void wfx_SetStationNetif(struct netif * newNetif)
{
    sta_netif = *newNetif;
}

struct netif * wfx_GetNetif(sl_wfx_interface_t interface)
{
    struct netif * SelectedNetif = NULL;
    if (interface == SL_WFX_STA_INTERFACE)
    {
        SelectedNetif = &sta_netif;
    }
#ifdef SL_WFX_CONFIG_SOFTAP
    else if (interface == SL_WFX_SOFTAP_INTERFACE)
    {
        // no ap currently
    }
#endif
    return SelectedNetif;
}

sl_wfx_mac_address_t wfx_get_wifi_mac_addr(sl_wfx_interface_t interface)
{
    // return Mac address used by WFX SL_WFX_STA_INTERFACE or SL_WFX_SOFTAP_INTERFACE,
    return (interface == SL_WFX_STA_INTERFACE) ? wifiContext.mac_addr_0 : wifiContext.mac_addr_1;
}

void wfx_set_wifi_provision(wfx_wifi_provision_t *wifiConfig)
{
    memcpy(wifi_provision.ssid, wifiConfig->ssid, sizeof(wifiConfig->ssid));
    memcpy(wifi_provision.passkey, wifiConfig->passkey, sizeof(wifiConfig->passkey));
    wifi_provision.security = wifiConfig->security;
}

bool wfx_get_wifi_provision(wfx_wifi_provision_t * wifiConfig)
{
    bool success = false;
    if (wifiConfig != NULL)
    {
        memcpy(wifiConfig, &wifi_provision, sizeof(wfx_wifi_provision_t));
        success = true;
    }

    return success;
}

void wfx_clear_wifi_provision(void)
{
    memset(&wifi_provision, 0, sizeof(wifi_provision));
}

sl_status_t wfx_connect_to_provisionned_ap(void)
{
    sl_status_t result = SL_STATUS_NOT_AVAILABLE;
    if (wifi_provision.ssid[0] != 0)
    {
        result =
            sl_wfx_send_join_command((uint8_t *) wifi_provision.ssid, strlen(wifi_provision.ssid), NULL, 0, wifi_provision.security,
                                     1, 0, (uint8_t *) wifi_provision.passkey, strlen(wifi_provision.passkey), NULL, 0);
    }

    return result;
}
